def interface():
    print('1 - Добавление контакта '
            '\n2 - Вывод всех контактов '
            '\n3 - Поиск по фамилии '
            '\n4 - работа с контактом'
            '\n5 - Выход')

def interface_changes():
    print('1 - Удаление контакта '
          '\n2 - Изменение контакта '
          '\n3 - Выход ')

def data_changes():
    print('1 - Изменение фамилии '
          '\n2 - Изменение имени '
          '\n3 - Изменение очества '
          '\n4 - Изменение номера телефона '
          '\n5 - Изменение всего контакта '
          '\n6 - Выход ')